{
    "equityNumber": "M00142495",
    "spotlightViewPin": "6215-7830-6082",
    "dob": "29/11/40",
    "agent": "-",
    "height": "6'2\"",
    "eyes": "Hazel",
    "hair": "Dark Brown/Graying",
    "build": "Slim",
    "contact": "(0131) 661-1123",
    "mobile": "(07886) 629-344",
    "email": "goon90@hotmail.com",
    "educated": "George Heriot`s School, Edinburgh, 1953 - 1959",
    "employment": [
        "Constable, Edinburgh City Police, latterly Lothian and Borders Police 1963-1993",
        "Scientific Assistant, Royal Scottish Museum 1959-1963"
    ],
    "information": [
        "I Became a fully professional actor April 1996.",
        "In 1993 I was awarded the British Empire Medal for services to cave rescue and crime prevention at the Edinburgh Festival."
    ],
    "training": [
        "Actors' Workshops, various.",
        "LAMDA Summer School 1962."
    ],
    "iHaveWrittenSeveralPlaysAndPublicationsTheseInclude": [
        "Handbook: Welcome to Leitheatre (2004) A wide ranging introduction to theatre for amateur newcomers.",
        "Crime at the Festival (1986) L. & B. Police. An analysis of security at theatre and fringe venues.",
        "The Story of Alexander Selkirk. Short Outdoor drama pageant.",
        "Just Another Friday (1997) 1 act Easter play.",
        "The Piper of Hamelin (1984) 2 act Childrens’ musical. (Music by Leslie Warrender)",
        "Soldier of Fortune (1984) 1 Act Christmas Play",
        "The Aten (1982) Major 2 act drama requiring a sizeable cast.",
        "Dying For Breath (1981) VT script about glue sniffing."
    ],
    "criticalReviews": [
        {
            "review": "....I have seen Ireby excel before as everything from a World War 2 private to Edward I and Thomas Cromwell. Here, as the anchoring dramatist, he brings a keening resonance to Neil Simon's central point: writing shouldn't be what you do it should be what you are. Effortlessly, Ireby renders credible in the opening scene the notion that his character has conjured up the ensuing episodes and figures.",
            "attribution": "Plays International: 'The Good Doctor'"
        },
        {
            "review": "....Alan Jeffreys made a superb brothel-keeper who still tried to maintain army discipline within his new establishment",
            "attribution": "Scotsman: A Flea in Her Ear. Edin. Festival"
        },
        {
            "review": "....the local preacher, who has a penchant for pies, booze and mammon - he is excellently portrayed by Alan Jeffreys.",
            "attribution": "The Stage: Sweeney Todd, Edin. Festival"
        },
        {
            "review": "....only Alan Jeffreys in the role of the two Indian chiefs brings a real touch of wild Obaldian extravagance to the play.",
            "attribution": "Festival Times: Wind in the Branches of the Sassafras. Edin. Festival"
        },
        {
            "review": ".... Alan Jeffreys gave the most gloriously consistent performance as Gratiano.",
            "attribution": "Scotsman: The Merchant of Venice"
        },
        {
            "review": "Alan Jeffreys’ John Worthing however, is admirably judged.",
            "attribution": "Scotsman: Importance of Being Earnest. Edin. Festival"
        },
        {
            "review": "Alan Jeffreys is truly terrifying - in the visual sense - as Jonathan Brewster, unrecognisable to his family after plastic surgery.",
            "attribution": "Evening News: Arsenic and old Lace. Edin. Festival"
        },
        {
            "review": "Alan Jeffreys’ grotesque Malvolio is the high point of this production, a perfect blend of pomposity and sprightly idiocy when required....a smiling, yellow-stockinged character which is simply gloriously silly.",
            "attribution": "Scotsman: Twelfth Night. Edin. Festival"
        },
        {
            "review": "....All three underplay beautifully, so their quiet internal experience always remains the focus.",
            "attribution": "The Stage: In The Line of Duty. Edin. Festival"
        },
        {
            "review": "...Sounding like Windsor Davies and looking like Blaikie from On the Buses, he stalked the stage with lean, angular movements reminiscent of John Cleese. A truly sinister gangling creation that deserves to be in the comedy hall of fame.",
            "attribution": "Evening News: Loot"
        },
        {
            "review": "Bruce Delamitri - played by Alan Jeffreys - is a credible centrepiece for proceedings, with a respectable accent and a fine line in comic timing...",
            "attribution": "Evening News: Popcorn"
        },
        {
            "review": "...this was largely due to Alan Jeffreys, whose resonantly voiced narration painted the vital word scenery with vivid clarity ... and his Reverend Eli Jenkins was a total joy.",
            "attribution": "South Wales Western Mail: Under Milk Wood"
        },
        {
            "review": "Alan Jeffreys provided not only bawdy humour as a stereotypical ex-soldier without resorting to clichés or posturing, but also real pathos as he showed his courage one final time.",
            "attribution": "Evening News: Willie Rough"
        }
    ]
}